app/controllers/program_courses_controller.rb

SELECT "programs".* FROM "programs" WHERE (id = 14)
---
  def show
    @program_course = ProgramCourse.find(params[:id])
		@chosen_courses = @program_course.load_class_name_array
		@program = Program.where("id = ?", @program_course.program_id)