app/controllers/program_courses_controller.rb

SELECT "program_courses".* FROM "program_courses"
---
  def index
    @program_courses = ProgramCourse.all

SELECT "courses".* FROM "courses" WHERE (id = 'course1')
SELECT "program_courses".* FROM "program_courses" WHERE "program_courses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @program_course = ProgramCourse.find(params[:id])

SELECT "program_courses".* FROM "program_courses" WHERE "program_courses"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "programs".* FROM "programs" WHERE (id = 1)
SELECT "courses".* FROM "courses"
---
  def edit
    @program_course = ProgramCourse.find(params[:id])
  	@program = Program.where("id = ?", @program_course.program_id)
  	@available_courses = Course.all

INSERT INTO "program_courses" ("created_at", "program_id", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 10 Dec 2012 21:40:31 UTC +00:00], ["program_id", nil], ["updated_at", Mon, 10 Dec 2012 21:40:31 UTC +00:00]]
---
  def create
    @program_course = ProgramCourse.new(params[:program_course])

    respond_to do |format|
      if @program_course.save

SELECT "program_courses".* FROM "program_courses" WHERE "program_courses"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "program_courses" SET "course4" = 614, "course5" = 613, "course6" = 628, "course7" = 631, "course8" = 630, "course9" = 625, "course10" = 628, "course11" = 614, "course12" = 613, "course13" = 613, "course14" = 614, "course15" = 613, "course16" = 628, "course17" = 630, "course18" = 630, "course19" = 629, "course20" = 630, "course21" = 615, "course22" = 614, "course23" = 614, "course24" = 630, "course25" = 631, "course26" = 631, "course27" = 627, "course28" = 616, "course29" = 614, "course30" = 627, "course31" = 628, "course32" = 627, "course33" = 623, "course34" = 613, "course35" = 613, "course36" = 614, "course37" = 627, "course38" = 630, "course39" = 631, "course40" = 627, "updated_at" = '2012-12-12 22:40:16.760147' WHERE "program_courses"."id" = 13
---
  def update
    @program_course = ProgramCourse.find(params[:id])

    respond_to do |format|
      if @program_course.update_attributes(params[:program_course])